Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_otg1_hs_device.h
// OTG_HS_DOEPTSIZ2 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT      (0x3U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_0    (0x1U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT              (0x3FFU<<19U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT_0            (0x1U<<19U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ              (0x7FFFFU<<0U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ_0            (0x1U<<0U)

// OTG_HS_DOEPCTL3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPENA                (0x1U<<31U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPDIS                (0x1U<<30U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SODDFRM              (0x1U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SD0PID_SEVNFRM       (0x1U<<28U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNAK                 (0x1U<<27U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_CNAK                 (0x1U<<26U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_STALL                (0x1U<<21U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNPM                 (0x1U<<20U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP                (0x3U<<18U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP_0              (0x1U<<18U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_NAKSTS               (0x1U<<17U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EONUM_DPID           (0x1U<<16U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_USBAEP               (0x1U<<15U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ                (0x7FFU<<0U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ_0              (0x1U<<0U)

// OTG_HS_DOEPINT3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_NYET                 (0x1U<<14U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_B2BSTUP              (0x1U<<6U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_OTEPDIS              (0x1U<<4U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_STUP                 (0x1U<<3U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_EPDISD               (0x1U<<1U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_XFRC                 (0x1U<<0U)

// OTG_HS_DOEPTSIZ3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT      (0x3U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_0    (0x1U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT              (0x3FFU<<19U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT_0            (0x1U<<19U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ              (0x7FFFFU<<0U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ_0            (0x1U<<0U)

// OTG_HS_DOEPCTL4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPENA                (0x1U<<31U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPDIS                (0x1U<<30U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SODDFRM              (0x1U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SD0PID_SEVNFRM       (0x1U<<28U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNAK                 (0x1U<<27U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_CNAK                 (0x1U<<26U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_STALL                (0x1U<<21U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNPM                 (0x1U<<20U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP                (0x3U<<18U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP_0              (0x1U<<18U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_NAKSTS               (0x1U<<17U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EONUM_DPID           (0x1U<<16U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_USBAEP               (0x1U<<15U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ                (0x7FFU<<0U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ_0              (0x1U<<0U)

// OTG_HS_DOEPINT4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_NYET                 (0x1U<<14U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_B2BSTUP              (0x1U<<6U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_OTEPDIS              (0x1U<<4U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_STUP                 (0x1U<<3U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_EPDISD               (0x1U<<1U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_XFRC                 (0x1U<<0U)

// OTG_HS_DOEPTSIZ4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT      (0x3U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT_0    (0x1U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT              (0x3FFU<<19U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT_0            (0x1U<<19U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ              (0x7FFFFU<<0U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ_0            (0x1U<<0U)

// OTG_HS_DOEPCTL5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPENA                (0x1U<<31U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPDIS                (0x1U<<30U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SODDFRM              (0x1U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SD0PID_SEVNFRM       (0x1U<<28U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SNAK                 (0x1U<<27U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_CNAK                 (0x1U<<26U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_STALL                (0x1U<<21U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SNPM                 (0x1U<<20U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPTYP                (0x3U<<18U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPTYP_0              (0x1U<<18U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_NAKSTS               (0x1U<<17U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EONUM_DPID           (0x1U<<16U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_USBAEP               (0x1U<<15U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ                (0x7FFU<<0U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ_0              (0x1U<<0U)

// OTG_HS_DOEPINT5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_NYET                 (0x1U<<14U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_B2BSTUP              (0x1U<<6U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_OTEPDIS              (0x1U<<4U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_STUP                 (0x1U<<3U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_EPDISD               (0x1U<<1U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_XFRC                 (0x1U<<0U)

// OTG_HS_DOEPTSIZ5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT      (0x3U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT_0    (0x1U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT              (0x3FFU<<19U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT_0            (0x1U<<19U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ              (0x7FFFFU<<0U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ_0            (0x1U<<0U)

// OTG_HS_DOEPCTL6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPENA                (0x1U<<31U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPDIS                (0x1U<<30U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SODDFRM              (0x1U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SD0PID_SEVNFRM       (0x1U<<28U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SNAK                 (0x1U<<27U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_CNAK                 (0x1U<<26U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_STALL                (0x1U<<21U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SNPM                 (0x1U<<20U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPTYP                (0x3U<<18U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPTYP_0              (0x1U<<18U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_NAKSTS               (0x1U<<17U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EONUM_DPID           (0x1U<<16U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_USBAEP               (0x1U<<15U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_MPSIZ                (0x7FFU<<0U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_MPSIZ_0              (0x1U<<0U)

