Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_otg1_hs_device.h
// OTG_HS_DOEPINT6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_NYET                 (0x1U<<14U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_B2BSTUP              (0x1U<<6U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_OTEPDIS              (0x1U<<4U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_STUP                 (0x1U<<3U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_EPDISD               (0x1U<<1U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_XFRC                 (0x1U<<0U)

// OTG_HS_DOEPTSIZ6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT      (0x3U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT_0    (0x1U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT              (0x3FFU<<19U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT_0            (0x1U<<19U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ              (0x7FFFFU<<0U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ_0            (0x1U<<0U)

// OTG_HS_DOEPCTL7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPENA                (0x1U<<31U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPDIS                (0x1U<<30U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SODDFRM              (0x1U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SD0PID_SEVNFRM       (0x1U<<28U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SNAK                 (0x1U<<27U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_CNAK                 (0x1U<<26U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_STALL                (0x1U<<21U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SNPM                 (0x1U<<20U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP                (0x3U<<18U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP_0              (0x1U<<18U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_NAKSTS               (0x1U<<17U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EONUM_DPID           (0x1U<<16U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_USBAEP               (0x1U<<15U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_MPSIZ                (0x7FFU<<0U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_MPSIZ_0              (0x1U<<0U)

// OTG_HS_DOEPINT7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_NYET                 (0x1U<<14U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_B2BSTUP              (0x1U<<6U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_OTEPDIS              (0x1U<<4U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_STUP                 (0x1U<<3U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_EPDISD               (0x1U<<1U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_XFRC                 (0x1U<<0U)

// OTG_HS_DOEPTSIZ7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT      (0x3U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT_0    (0x1U<<29U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT              (0x3FFU<<19U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT_0            (0x1U<<19U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ              (0x7FFFFU<<0U)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ_0            (0x1U<<0U)
